---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures
source: html/3a791c57-0441-8cd3-5285-697d794e7019.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures

Failures about SpanDirectionSymbol.

## Syntax (C#)
```csharp
public static class SpanDirectionSymbolFailures
```